AcDbSubentGeometry.curve
Returns pointer to the curve of the edge subentity.
Returns:  Pointer to the curve of the edge subentity. The curve is not
owned by this AcDbSubentGeometry.

AcDbSubentGeometry.point
Returns coordinates of the vertex subentity.
Returns:  Coordinates of the vertex subentity.

AcDbSubentGeometry.type
Returns AcDb::SubentType of the subentity.
Returns:  AcDb::SubentType.

AcDbSubentGeometry.#ctor(AcGeCurve3d*)
Constructor initializing with an edge subnetity.
pCurve:  The curve is not owned by this AcDbSubentGeometry.

AcDbSubentGeometry.#ctor(AcGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor initializing with a vertex subentity.
pnt:  The coordinates of the point subentity.

AcDbSubentGeometry.#ctor
Default constructor.

AcDbSubentGeometry
A simple class that just keeps geometry of a vertex or edge subentity.
Remarks:
Notice that no copy constructor, assignment operator or destructor are
implemented that would manage the referenced curve. The AcDbSubentGeometry
is not the owner of the curve, it just references it.